{
	"summary": [
		"I am an applied mathematician, data scientist, software engineer, technologist and inventor with over 30 years of industrial and academic experience in research, software development, technology, innovation and teaching.",
		"I received my PhD in Applied Mathematics from the University of California, Davis in 1998, where I worked with Dr. Joel Keizer at the Institute of Theoretical Dynamics on mathematical and computational models of cellular calcium signalling. I then did an NIH NRSA Postdoctoral Fellowship with Dr. Leslie Loew at the National Resource for Cell Analysis and Modeling at the University of Connecticut Health Center.",
		"I joined IBM Research in 2004 in Yorktown Heights, NY, where I worked on p53 signalling in cancer, cellular pathway analysis and ultra-scalable, large-scale neural tissue simulation. I moved to Melbourne in 2010 to lead the IBM Research Collaboratory for Life Sciences—Melbourne at the Victorian Life Sciences Computation Initiative at the University of Melbourne. My team delivered, maintained and performed collaborative research on the first Blue Gene systems in Australia, including the largest machine devoted entirely to life sciences research in the Southern Hemisphere. Our work covered a range of projects, including molecular dynamics-based simulation and analysis of enzyme dynamics; molecular and fluid dynamics-based studies of proteins in nanopores and nanodevices; molecular dynamics simulations of cellulose microfibril structure, dynamics and adsorption; and TGF-β and IL-6 signalling in colorectal cancer.",
		"After my team joined the IBM Research—Australia lab in 2015, I worked as a researcher and software engineer on a wide range of projects, including artificial intelligence in diagnostic ophthalmology; machine learning in patent analysis; cloud-based personal weather forecasting; and blockchain project management and software development in international transport and finance.",
		"I have also held an Honorary Fellow appointment in Mathematics, and Honorary and Senior Fellow appointments in Electrical and Electronic Engineering—and taught extensively—at the University of Melbourne.",
		"I have co-authored 38 journal papers, conference papers and book chapters as well as 66 patents awarded in the US, China and Japan. My work has been cited 7,689 times and I have an h-index of 26 and an i10-index of 44. I also co-edited the graduate level text, Computational Cell Biology (Springer Interdisciplinary Applied Mathematics, 2002). While at IBM I received four IBM Research Division awards, sixteen IBM Invention Achievement Awards and was named an IBM Master Inventor in 2014 and 2019."
	],
	"coreValues": [
		"Diversity",
		"Equity",
		"Inclusion",
		"Integrity",
		"Education",
		"Community"
	],
	"expertise": [
		"Ordinary and Partial Differential Equations",
		"Numerical Analysis and Linear Algebra",
		"Mathematical and Computational Biology",
		"Functional Genomics and Systems Biology",
		"Biophysical Modelling and Simulation",
		"Scientific and High Performance Computing",
		"Distributed Computing and Blockchain",
		"Big Data, Storage and Database Systems",
		"Machine and Deep Learning",
		"Statistical and Data Analysis",
		"Data Structures and Algorithms",
		"Software Engineering and Engineering Leadership",
		"Development, Programming, Coding and Scripting",
		"Academic and Industrial Research and Publication",
		"Project, Research and People Management",
		"",
		"Technology, Innovation, Invention and Patents"
	],
	"skills": [
		"C",
		"C++",
		"Python",
		"JavaScript",
		"React",
		"Material-UI",
		"TypeScript",
		"Plotly",
		"Tensorflow",
		"Keras",
		"scikit-learn",
		"Hyperledger",
		"numpy",
		"Pandas",
		"SQL",
		"Docker"
	],
	"industries": [
		"Healthcare",
		"Life Sciences",
		"Higher Education",
		"Government",
		"Transportation",
		"Finance",
		"Contract Law",
		"Intellectual Property"
	],
	"education": [
		{
			"year": 1998,
			"degree": "PhD, Applied Mathematics",
			"institution": "University of California, Davis",
			"info": "Dissertation: A Mathematical Model of the Fertilization Ca2+ Wave in Xenopus laevis Oocytes"
		},
		{
			"year": 1994,
			"degree": "MS, Applied Mathematics",
			"institution": "University of California, Davis",
			"info": "Thesis: Effects of Rapid Buffers on Ca2+ Diffusion and Ca2+ Oscillations"
		},
		{
			"year": 1990,
			"degree": "BS, Mathematics",
			"institution": "University of California, Davis",
			"info": null
		}
	],
	"experience": [
		{
			"dates": "2019 - 2021",
			"title": "Research Staff Member",
			"organisation": "IBM Research-Australia, AI for the Eye/Healthcare, Melbourne, VIC",
			"duties": "Working with the entire AI for the Eye team, led the development of a software platform for showcasing all of the lab’s research as well as the development of a proof-of-concept diagnostic ophthalmology project in explainable AI using deep learning and machine learning based analysis of fundus and optical coherence tomography imaging of the retina."
		},
		{
			"dates": "2017 - 2019",
			"title": "Research Staff Member",
			"organisation": "IBM Research-Australia, Blockchain Research and Development, Melbourne, VIC",
			"duties": "Performed blockchain research and development, including front end software engineering on large commercial venture in finance and technical leadership of a successful proof-of-concept project in international transport and supply chain involving IBM teams in three countries."
		},
		{
			"dates": "2015 - 2017",
			"title": "Manager and Research Staff Member",
			"organisation": "IBM Research-Australia, Computational Biology/Healthcare, Melbourne, VIC",
			"duties": "Managed the IBM Research Australia’s Computational Biophysics team; performed extensive recruiting, interviewing, hiring and mentoring of staff and student researchers; contributed extensively to the lab’s healthcare and life sciences research and business strategies and portfolios; worked across business units on client engagements; and performed extensive patenting, mentoring of new inventors and service to IBM’s intellectual property processes."
		},
		{
			"dates": "2015 - 2016",
			"title": "Honorary Fellow",
			"organisation": "Department of Electrical and Electronic Engineering, University of Melbourne, Melbourne, VIC",
			"duties": "Taught full courses and sections of courses, co-supervised students and worked with faculty and students on accessing and using the Blue Gene/P and Q systems at the Victorian Life Sciences Computation Initiative, including parallelising and optimising their research codes."
		},
		{
			"dates": "2012 - 2015",
			"title": "Scientific Advisory Committee Member",
			"organisation": "Centre for Neural Engineering, University of Melbourne, Melbourne, VIC",
			"duties": "Advised the Centre’s management on scientific and business strategy and provided feedback on the Centre’s research, particularly with an industry and industrial applied research perspective."
		},
		{
			"dates": "2011 - 2014",
			"title": "Senior Fellow",
			"organisation": "Department of Electrical and Electronic Engineering, University of Melbourne, Melbourne, VIC",
			"duties": "Taught full courses and sections of courses, co-supervised students and worked with faculty and students on accessing and using the Blue Gene/P and Q systems at the Victorian Life Sciences Computation Initiative, including parallelising and optimising their research codes."
		},
		{
			"dates": "2010 - 2014",
			"title": "Manager and Research Staff Member",
			"organisation": "IBM Research Collaboratory for Life Sciences-Melbourne, Melbourne, VIC",
			"duties": "Managed a team of seven full-time researchers and Blue Gene support staff as key partners of the Victorian Life Sciences Computation Initiative; oversaw and managed the delivery and maintenance of two generations of Blue Gene supercomputers offering life sciences compute cycles to Victoria; formulated and managed Collaboratory’s multidisciplinary computational life sciences research strategy and projects; recruited, managed and mentored the Collaboratory’s student research interns; led and performed computational life sciences research in multiple disciplines; and recruited, interviewed, hired and/or mentored over a hundred research staff members and student researchers for the IBM Research Australia lab."
		},
		{
			"dates": "2010 - 2013",
			"title": "Honorary Fellow",
			"organisation": "Department of Mathematics and Statistics, University of Melbourne, Melbourne, VIC",
			"duties": "Taught sections of courses and worked with faculty and students on accessing and using the Blue Gene/P system at the Victorian Life Sciences Computation Initiative, including parallelising and optimising their research codes."
		},
		{
			"dates": "2004 - 2010",
			"title": "Long-Term Supplemental",
			"organisation": "Computational Biology Center, IBM T.J. Watson Research Center, Yorktown Heights, NY",
			"duties": "Performed mathematical and computational modelling research on p53 signalling in cancer; developed numerical and computational approaches and algorithms for large-scale neural tissue simulation on Blue Gene/L supercomputers; and worked with a large team across many IBM business units and geographies to develop and land a large partnership deal with the University of Melbourne."
		},
		{
			"dates": "2000 - 2004",
			"title": "NIH NRSA Postdoctoral Fellow",
			"organisation": "Department of Physiology, University of Connecticut Health Center, Farmington, CT",
			"duties": "Applied for and received NIH NRSA Postdoctoral Fellowship and performed wet lab and computational modelling research on calcium and inositol trisphosphate signalling in Xenopus laevis eggs following fertilisation."
		},
		{
			"dates": "1999 - 2004",
			"title": "Postdoctoral Fellow",
			"organisation": "National Resource for Cell Analysis and Modeling, Department of Physiology, University of Connecticut Health Center, Farmington, CT",
			"duties": "Working within a large team of software developers and biologists, performed full-stack software engineering and computational science on The Virtual Cell Project: designed and implemented parallel and single-core numerical and computational algorithms for cellular analysis and spatial modelling; designed, built and maintained Center’s first parallel computing infrastructure, a sixteen-node DEC Alpha-based Beowulf cluster; and designed, implemented and maintained The Virtual Cell Project’s java- and C++-based software codebase."
		},
		{
			"dates": "1998 - 1999",
			"title": "Scientific Programmer/Programmer IV",
			"organisation": "Institute of Theoretical Dynamics, University of California, Davis, Davis, CA",
			"duties": "Designed, built and maintained Institute’s first parallel computing infrastructure, a sixteen-node DEC Alpha-based Beowulf cluster; performed extensive training of all of the Institute’s faculty, postdocs and students using the cluster; and performed collaborative scientific research using this system."
		},
		{
			"dates": "1994 - 1997",
			"title": "Research Assistant",
			"organisation": "Information Center for the Environment, University of California, Davis, Davis, CA",
			"duties": "Performed full-stack software engineering and web development on a range of environmental projects, including California’s first environmental toxicology database developed in conjunction with the California Governor’s Office for Planning and Research."
		},
		{
			"dates": "1994 - 1995",
			"title": "Teaching Assistant / Associate-in-Teaching",
			"organisation": "Department of Mathematics, University of California, Davis, Davis, CA",
			"duties": "Taught undergraduate course in ordinary differential equations course of 68 students and received departmental citation for excellence in teaching."
		},
		{
			"dates": "1992 - 1998",
			"title": "Research Assistant",
			"organisation": "Institute of Theoretical Dynamics, University of California, Davis, Davis, CA",
			"duties": "Performed collaborative scientific research in cellular calcium buffering and signalling and designed, built and maintained Institute’s entire computational infrastructure (workstations, PCs and laptops) used by Institute’s research faculty and staff."
		},
		{
			"dates": "1989 - 1992",
			"title": "Site Aide / Postgraduate Researcher",
			"organisation": "Institute of Theoretical Dynamics, University of California, Davis, Davis, CA",
			"duties": "Performed collaborative scientific research in healthcare, life sciences, chemistry and physics and maintained Institute’s entire computational infrastructure (workstations, PCs and laptops) used by Institute’s research faculty and staff."
		},
		{
			"dates": "1988",
			"title": "Praktikant/Software Developer",
			"organisation": "Product Marketing and Support, Nixdorf Computer AG, Paderborn, Germany",
			"duties": "Full-stack software engineer on Project Management System used across Nixdorf’s entire Product Marketing and Support team. Designed, developed and delivered C- and SQL-based system in two months."
		}
	],
	"teaching": [
		{
			"dates": "2018 - 2020",
			"course": "So, you want to be a Master Inventor, eh?",
			"organisation": "IBM Research-Australia"
		},
		{
			"dates": "2017",
			"course": "Building Your Eminence and Career in Research and IBM Research",
			"organisation": "IBM Research-Australia"
		},
		{
			"dates": "2016 - 2019",
			"course": "Invent! Collaborate! Patent!",
			"organisation": "IBM Australia"
		},
		{
			"dates": "2013 - 2016",
			"course": "Parallel and Multicore Computing (COMP90025)",
			"organisation": "The University of Melbourne"
		},
		{
			"dates": "2011 - 2013",
			"course": "Two-week section of Neural Information Processing (BMEN90002)",
			"organisation": "The University of Melbourne"
		},
		{
			"dates": "1999 - 2002",
			"course": "Neurophysiology Conference, School of Medicine",
			"organisation": "The University of Connecticut"
		},
		{
			"dates": "1999 - 2002",
			"course": "Axonology Laboratory, School of Medicine",
			"organisation": "The University of Connecticut"
		},
		{
			"dates": "1993 - 1997",
			"course": "C/C++/High Performance and Scientific Computing",
			"organisation": "The University of California, Davis"
		},
		{
			"dates": "1997",
			"course": "Numerical Analysis Computer Laboratory, Department of Mathematics",
			"organisation": "The University of California, Davis"
		},
		{
			"dates": "1995",
			"course": "Ordinary Differential Equations, Department of Mathematics",
			"organisation": "The University of California, Davis"
		},
		{
			"dates": "1995",
			"course": "Ordinary Differential Equations Computer Lab, Department of Mathematics",
			"organisation": "The University of California, Davis"
		},
		{
			"dates": "1994 - 1995",
			"course": "Numerical Analysis (Teaching Assistant), Department of Mathematics",
			"organisation": "The University of California, Davis"
		}
	],
	"service": [
		{
			"dates": "2021 -",
			"title": "Mentor",
			"organisation": "Melbourne University Bioengineering Society (MUBES)"
		},
		{
			"dates": "2012 - 2021",
			"title": "Member OF IBM Intellectual Property Development Teams (IDT)",
			"organisation": "IBM Research—Australia IDT, Global Services IDT and Global Blockchain IDT"
		},
		{
			"dates": "2016 - 2018",
			"title": "First Aider",
			"organisation": "St. John Caulfield Grammar School Division, Caulfield, VIC"
		},
		{
			"dates": "2012 - 2015",
			"title": "Member, Scientific Advisory Committee",
			"organisation": "Centre for Neural Engineering, The University of Melbourne, Melbourne, VIC"
		},
		{
			"dates": "2010 – 2015",
			"title": "Member, IBM Research/The University of Melbourne Partnership Committee",
			"organisation": "The University of Melbourne, Melbourne, VIC"
		},
		{
			"dates": "2010 – 2015",
			"title": "Member, Joint Management Committee",
			"organisation": "Victorian Life Sciences Computation Initiative, The University of Melbourne, Melbourne, VIC"
		},
		{
			"dates": "2000 -",
			"title": "Member",
			"organisation": "Systems Biology Markup Language (SBML) working group"
		},
		{
			"dates": "1981 – 1983",
			"title": "EMT/Firefighter",
			"organisation": "Occidental Volunteer Fire Department, Occidental, CA"
		},
		{
			"dates": "1979 – 1981",
			"title": "Explorer Scout",
			"organisation": "Twin Hills Fire Protection District, Twin Hills, CA"
		},
		{
			"dates": "1976 – 1979",
			"title": "Scout",
			"organisation": "Boy Scouts of America, Troop 128, Sebastopol, CA"
		}
	]
}